wiki/specifications/rivta/infrastructure.itintegration.messaging/SendMessageInteraction_example1.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:riv:itintegration:registry:1" xmlns:urn1="urn:riv:infrastructure:itintegration:messaging:SendMessageResponder:1" xmlns:urn2="urn:riv:infrastructure:itintegration:messaging:1">
   <soapenv:Header>
      <urn:LogicalAddress>SE2321000131-E000000000001</urn:LogicalAddress>
   </soapenv:Header>
   <soapenv:Body>
      <urn1:SendMessage>
         <urn1:message>
            <urn2:idempotentId>c33ab9c6-c7bd-40c6-9509-02cb4ae1936c</urn2:idempotentId>
            <urn2:sender>
               <!--Optional:-->
               <urn2:senderId>
                  <urn2:id>SE2321000131-E000000010473</urn2:id>
                  <urn2:codeSystem>1.2.752.129.2.1.4.1</urn2:codeSystem>
               </urn2:senderId>
               <!--Optional:-->
               <urn2:name>Närhälsan Bergsjön</urn2:name>
               <urn2:shortName>Närhälsan</urn2:shortName>

               <!--You may enter ANY elements at this point-->
            </urn2:sender>
            <!--1 or more repetitions:-->
            <urn2:recipient>
               <urn2:address>467330000000</urn2:address>
               <urn2:addressType>
                  <urn2:code>sms</urn2:code>
                  <urn2:codeSystem>KV VGR Kommunikationssätt</urn2:codeSystem>
               </urn2:addressType>
            </urn2:recipient>
            <urn2:body>Hej Lisa! Vi vill påminna dig om ditt besök till Närhälsan Bergsjön barnmorskemottagning den 24/12 klockan 15:00!</urn2:body>
            <urn2:replyable>false</urn2:replyable>
            <!--Optional:-->
            <urn2:conversationId>fe2aab7a-b753-4c04-a326-3371e497d6f8</urn2:conversationId>
            <!--Optional:-->
            <urn2:billingInformation>
               <!--Optional:-->
               <urn2:costCenter>1234567890</urn2:costCenter>
               <!--You may enter ANY elements at this point-->
            </urn2:billingInformation>
            <!--You may enter ANY elements at this point-->
         </urn1:message>
         <!--You may enter ANY elements at this point-->
      </urn1:SendMessage>
   </soapenv:Body>
</soapenv:Envelope>